diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот_план</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот_план</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ДокументИзменен = Ложь;
	ТекстСообщения = "";
	
	Если Не ТекущийОбъект.Проведен Тогда 
		ДокументИзменен = Истина;
		ТекстСообщения =  СтрШаблон("Создан новый документ: %1", ТекущийОбъект);
	Иначе
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект, "ДатаПроведенияРабот, ВремяНачалаРабот_план, ВремяОкончанияРабот_план, Специалист");
		Если ДанныеДокумента.ДатаПроведенияРабот <> ТекущийОбъект.ДатаПроведенияРабот Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилась дата проведения работ с %2 на %3", ТекущийОбъект.Ссылка, Формат(ДанныеДокумента.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(ТекущийОбъект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));
		КонецЕсли;
		Если ДанныеДокумента.ВремяНачалаРабот_план <> ТекущийОбъект.ВремяНачалаРабот_план Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилось время начала работ (план) с %2 на %3", ТекущийОбъект.Ссылка, Формат(ДанныеДокумента.ВремяНачалаРабот_план, "ДЛФ=T;"), Формат(ТекущийОбъект.ВремяНачалаРабот_план, "ДЛФ=T;"));
		КонецЕсли;
		Если ДанныеДокумента.ВремяОкончанияРабот_план <> ТекущийОбъект.ВремяОкончанияРабот_план Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилось время окончания работ (план) с %2 на %3", ТекущийОбъект.Ссылка, Формат(ДанныеДокумента.ВремяОкончанияРабот_план, "ДЛФ=T;"), Формат(ТекущийОбъект.ВремяОкончанияРабот_план, "ДЛФ=T;"));
		КонецЕсли;
		Если ДанныеДокумента.Специалист <> ТекущийОбъект.Специалист Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменился специалист с %2 на %3", ТекущийОбъект.Ссылка, ДанныеДокумента.Специалист, ТекущийОбъект.Специалист);
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументИзменен Тогда 
		
		НовыйСпр = Справочники.ВКМ_УведомленияТелеграм_БотуДляОтправки.СоздатьЭлемент();
		НовыйСпр.ТекстСообщения = ТекстСообщения; 
		НовыйСпр.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи); 
	
	Оповестить("Запись_ВКМ_ОбслуживаниеКлиентов",, Объект.Ссылка);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПодключаемыеКоманды

//ВКМ_Еговцева_Ольга_2024_06_19+
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//ВКМ_Еговцева_Ольга_2024_06_19-

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ_Еговцева_Ольга_2024_06_19+
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
//ВКМ_Еговцева_Ольга_2024_06_19-

#КонецОбласти
